; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
; params: satgen 948006 2 2 4 4 5
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	infrared1 - mode
	thermograph3 - mode
	infrared2 - mode
	infrared0 - mode
	GroundStation2 - direction
	Star3 - direction
	GroundStation0 - direction
	Star1 - direction
	Planet4 - direction
	Planet5 - direction
	Star6 - direction
	Phenomenon7 - direction
	Star8 - direction
)
(:init
	(supports instrument0 thermograph3)
	(supports instrument0 infrared1)
	(supports instrument0 infrared0)
	(calibration_target instrument0 Star1)
	(supports instrument1 infrared0)
	(supports instrument1 infrared2)
	(calibration_target instrument1 GroundStation0)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star1)
	(supports instrument2 thermograph3)
	(calibration_target instrument2 Star1)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation0)
)
(:goal (and
	(pointing satellite1 Star3)
	(have_image Planet4 thermograph3)
	(have_image Planet5 infrared0)
	(have_image Star6 thermograph3)
	(have_image Phenomenon7 infrared1)
	(have_image Star8 infrared1)
))

)

; plan
1. (turn_to satellite1 star3 groundstation0)
   deleted: (pointing satellite1 groundstation0)
   added: (pointing satellite1 star3)
   goals met: 1 of 6
2. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 1 of 6
3. (switch_on instrument2 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument2)
   goals met: 1 of 6
4. (calibrate satellite0 instrument0 star1)
   added: (calibrated instrument0)
   goals met: 1 of 6
5. (turn_to satellite1 star6 star3)
   deleted: (pointing satellite1 star3)
   added: (pointing satellite1 star6)
   goals met: 0 of 6
6. (turn_to satellite0 star8 star1)
   deleted: (pointing satellite0 star1)
   added: (pointing satellite0 star8)
   goals met: 0 of 6
7. (turn_to satellite1 star1 star6)
   deleted: (pointing satellite1 star6)
   added: (pointing satellite1 star1)
   goals met: 0 of 6
8. (take_image satellite0 star8 instrument0 infrared1)
   added: (have_image star8 infrared1)
   goals met: 1 of 6
9. (calibrate satellite1 instrument2 star1)
   added: (calibrated instrument2)
   goals met: 1 of 6
10. (turn_to satellite0 planet5 star8)
   deleted: (pointing satellite0 star8)
   added: (pointing satellite0 planet5)
   goals met: 1 of 6
11. (turn_to satellite1 star6 star1)
   deleted: (pointing satellite1 star1)
   added: (pointing satellite1 star6)
   goals met: 1 of 6
12. (take_image satellite0 planet5 instrument0 infrared0)
   added: (have_image planet5 infrared0)
   goals met: 2 of 6
13. (take_image satellite1 star6 instrument2 thermograph3)
   added: (have_image star6 thermograph3)
   goals met: 3 of 6
14. (turn_to satellite0 phenomenon7 planet5)
   deleted: (pointing satellite0 planet5)
   added: (pointing satellite0 phenomenon7)
   goals met: 3 of 6
15. (turn_to satellite1 star3 star6)
   deleted: (pointing satellite1 star6)
   added: (pointing satellite1 star3)
   goals met: 4 of 6
16. (take_image satellite0 phenomenon7 instrument0 infrared1)
   added: (have_image phenomenon7 infrared1)
   goals met: 5 of 6
17. (turn_to satellite1 planet4 star3)
   deleted: (pointing satellite1 star3)
   added: (pointing satellite1 planet4)
   goals met: 4 of 6
18. (turn_to satellite0 planet4 phenomenon7)
   deleted: (pointing satellite0 phenomenon7)
   added: (pointing satellite0 planet4)
   goals met: 4 of 6
19. (take_image satellite1 planet4 instrument2 thermograph3)
   added: (have_image planet4 thermograph3)
   goals met: 5 of 6
20. (turn_to satellite1 star3 planet4)
   deleted: (pointing satellite1 planet4)
   added: (pointing satellite1 star3)
   goals met: 6 of 6
